# -*- coding: UTF-8 -*-
errors = {
    -40520001: u'未知错误',
    -40520003: u'系统错误',
    -40520005: u'无权限',
    -40520007: u'无数据',
    -40520009: u'本地WBOX错误',
    -40520011: u'需要服务器不存在',
    -40520013: u'其他地方登录错误',
    -40520015: u'连续登录失败次数过多',
    -40521001: u'IO操作错误',
    -40521003: u'网络连接失败',
    -40521005: u'数据接收失败',
    -40521007: u'服务器拒绝请求',
    -40521009: u'数据解码失败',
    -40521011: u'频繁访问',
    -40522001: u'无合法会话',
    -40522003: u'非法请求',
    -40522005: u'不支持的万得代码',
    -40522007: u'不支持的指标',
    -40522009: u'不支持的指标参数',
    -40522011: u'不支持的日期与时间',
    -40522013: u'数组下标越界',
    -40522015: u'请求无相应权限',
    -40522017: u'数据提取量超限',
    -40520002: u'内部错误',
    -40520004: u'登录失败',
    -40520006: u'用户取消',
    -40520008: u'超时错误',
    -40521010: u'超时错误',
    -40520010: u'需要内容不存在',
    -40520012: u'引用不存在',
    -40520014: u'未登录使用WIM工具，故无法登录',
    -40521002: u'后台服务器不可用',
    -40521004: u'请求发送失败',
    -40521006: u'网络错误',
    -40521008: u'错误的应答',
    -40521010: u'网络超时',
    -40522002: u'非法数据服务',
    -40522004: u'万得代码语法错误',
    -40522006: u'指标语法错误',
    -40522008: u'指标参数语法错误',
    -40522010: u'日期与时间语法错误',
    -40522012: u'不支持的请求参数',
    -40522014: u'重复的WQID',
    -40522016: u'不支持的数据类型'
}


def get_error(code):
    if code in errors:
        return errors[code]
    else:
        return u'Error code undefined by Wind'
